import nagisa

text = """
高橋様

お世話になっております。
クラウドエースの石塚です。

サポートプランとは別になりますが、
日頃お世話になっている企業様へ向け
「【第5回】クラウドエース ユーザー会」を開催致します。

本イベントはクラウドエースのユーザー様をご招待し、日頃の感謝をお伝えすると共に、
GCPの活用方法や最新の事例などを共有するイベントです。
弊社からはもちろんのこと、ユーザー企業様にもご登壇いただき、
実際の活用例や取り組みなどをご紹介いただきます。
今回ご登壇頂ける企業様は弊社との背景も色々とあり面白いお話が聞けるかと思いますので、
ぜひお時間あれば情報収集の場としてご参加いただければと存じます。

【日時・場所】
開催日　：2020年3月11日(水)
会場　　：グーグル合同会社・渋谷オフィス　〒150-0002 東京都渋谷区渋谷３丁目２１−３
料金　　：無料
開催時間：14:30 - 18:00（14:00受付開始）
定員　　：100名（クラウドエース ユーザー企業様限定）
ユーザー様事例紹介：アクセンチュア様、プレイド、BenQ様

申し込みフォームはこちらでございます。
アジェンダ等は上記フォーム内に記載がございます。
少しでもご興味を持っていただけましたら、ぜひご参加いただけますと幸甚でございます
複数名でいらっしゃる場合、参加される皆様がそれぞれお申し込みくださいませ
1企業様につき2，3名を想定しておりまして。こちらを超える場合はご一報お願いいたします

またトレーニングも3月開催までのものであれば、
半額にてご対応いたしますのでご要望がありましたらお申し付けくださいませ。
■トレーニング
https://www.cloud-ace.jp/gcp-training/?utm_source=globalmenu&utm_medium=training&utm_campaign=ca-header-globalmenu

不明点あれば忌憚なくお申し付けください。
以上引き続きよろしくお願いいたします
-- 
・GCP利用料3%OFF　支払代行サービス
　https://www.cloud-ace.jp/service/

・GCP/AWSサービス対応/比較表
　https://goo.gl/dMHvwc

================================================
クラウドエース株式会社　第一営業部
" 信実さを持ち、応えていく "
茨城県出身　　石塚　健斗　〈KENTO　ISHIZUKA〉　
e-mail　ishizuka@cloud-ace.jp
web　　https://www.cloud-ace.jp?xx=1

tel　　  03-6280-5939　（本社）
tel         080-3668-6458   （携帯）
fax　　 03-6800-3954 
address 〒100-0004 
              東京都千代田区大手町2丁目6番2号 日本ビルヂング11F
"""
texts = text.splitlines()
for text in texts:
    words = nagisa.tagging(text)
    print("___________________________________")
    print(words)
    #=> Python/名詞 で/助詞 簡単/形状詞 に/助動詞 使える/動詞 ツール/名詞 です/助動詞

    # Get a list of words
    print(words.words)
    #=> ['Python', 'で', '簡単', 'に', '使える', 'ツール', 'です']

    # Get a list of POS-tags
    print(words.postags)
    #=> ['名詞', '助詞', '形状詞', '助動詞', '動詞', '名詞', '助動詞']
    if '動詞' not in words.postags:
        print("signature")